src/cf/InformationRegisters/НастройкиЗагрузкиПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЗагрузкиПисем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантЗагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗагрузкиПисем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСинхронизацииПисем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУдаления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУдаленияПисем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСостоянияНовыхПисем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйДляНовыхПисем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПочтоваяПапка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиЗагрузкиПисем/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВсеНастройкиВЗапросе(УчетнаяЗапись) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиЗагрузкиПисем.ПочтоваяПапка КАК ПочтоваяПапка,
		|	НастройкиЗагрузкиПисем.ВариантЗагрузки КАК ВариантЗагрузки,
		|	НастройкиЗагрузкиПисем.ВариантСинхронизации КАК ВариантСинхронизации,
		|	НастройкиЗагрузкиПисем.ВариантУдаления КАК ВариантУдаления,
		|	НастройкиЗагрузкиПисем.ВариантСостояния КАК ВариантСостояния,
		|	НастройкиЗагрузкиПисем.ОтветственныйДляНовыхПисем КАК ОтветственныйДляНовыхПисем
		|ИЗ
		|	РегистрСведений.НастройкиЗагрузкиПисем КАК НастройкиЗагрузкиПисем
		|ГДЕ
		|	НастройкиЗагрузкиПисем.УчетнаяЗапись = &УчетнаяЗапись";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
